# Visible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItem..::..Visible Property
RibbonItem Class See Also
---
Gets or sets a value indicating whether the item is visible.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool Visible { get; set; }
```

Visual Basic
---
```text
Public Property Visible As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Visible {
	bool get ();
	void set (bool value);
}
```

# Remarks
When the Visible property is set to false, the item won't be displayed on Ribbon.
# See Also
RibbonItem Class
Autodesk.Revit.UI Namespace